#ifndef __PIN_ALLOCATION_H
#define __PIN_ALLOCATION_H



/******************************************************************************/
//常用功能的代码引用





//常用功能的代码引用
/******************************************************************************/






/**********************单片机引脚的分配****************************单片机引脚的命名*****************************/
//  模板：
//  #define Zuodian_Heating  GPIOD,GPIO_PIN_0

#define TMSTB  GPIOA,GPIO_PIN_3
#define TMCLK  GPIOA,GPIO_PIN_2
#define TMDIO  GPIOA,GPIO_PIN_1

/**********************单片机引脚的分配****************************单片机引脚的命名*****************************/

#endif